/*=====================================================================================================

	デバックフォントモジュール[debug_font.h]
																author:mgc
																date:2020/07/03
-------------------------------------------------------------------------------------------------------

=======================================================================================================*/
#ifndef DEBUG_FONT_H
#define DEBUG_FONT_H


//デバックフォントモジュールの初期化
void DebugFont_Initialize(void);

//デバックフォントモジュールの終了処理
void DebugFont_Finalize(void);

//デバックフォントの表示
//
//引数：dx,dy    ...デバック文字列の描画座標
//		pString  ...デバック文字列へのポインタ
//
void DebugFont_Draw(float dx, float dy, const char* pString);

#endif // !DEBUG_FONT_H

