/*=====================================================================================================

	ゲームの制御[game.h]
																author:mgc
																date:2020/06/24
-------------------------------------------------------------------------------------------------------

=======================================================================================================*/
#ifndef GAME_H
#define GAME_H

//ゲームの初期化
void Game_Initialize(void);

//ゲームの更新処理
void Game_Update(void);

//ゲームの描画処理
void Game_Draw(void);

//ゲームの終了処理
void Game_Finalize(void);

#endif // !GAME_H
